HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 798, Read Data and Bit Flip Register 28 */
#define MTU_MC7_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061798u)

/** \brief 79A, Read Data and Bit Flip Register 29 */
#define MTU_MC7_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Au)

/** \brief 79C, Read Data and Bit Flip Register 30 */
#define MTU_MC7_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Cu)

/** \brief 79E, Read Data and Bit Flip Register 31 */
#define MTU_MC7_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006179Eu)

/** \brief 7A0, Read Data and Bit Flip Register 32 */
#define MTU_MC7_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A0u)

/** \brief 7A2, Read Data and Bit Flip Register 33 */
#define MTU_MC7_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A2u)

/** \brief 7A4, Read Data and Bit Flip Register 34 */
#define MTU_MC7_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A4u)

/** \brief 7A6, Read Data and Bit Flip Register 35 */
#define MTU_MC7_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A6u)

/** \brief 7A8, Read Data and Bit Flip Register 36 */
#define MTU_MC7_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617A8u)

/** \brief 7AA, Read Data and Bit Flip Register 37 */
#define MTU_MC7_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617AAu)

/** \brief 7AC, Read Data and Bit Flip Register 38 */
#define MTU_MC7_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617ACu)

/** \brief 7AE, Read Data and Bit Flip Register 39 */
#define MTU_MC7_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617AEu)

/** \brief 7B0, Read Data and Bit Flip Register 40 */
#define MTU_MC7_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B0u)

/** \brief 7B2, Read Data and Bit Flip Register 41 */
#define MTU_MC7_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B2u)

/** \brief 7B4, Read Data and Bit Flip Register 42 */
#define MTU_MC7_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B4u)

/** \brief 7B6, Read Data and Bit Flip Register 43 */
#define MTU_MC7_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B6u)

/** \brief 7B8, Read Data and Bit Flip Register 44 */
#define MTU_MC7_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617B8u)

/** \brief 7BA, Read Data and Bit Flip Register 45 */
#define MTU_MC7_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BAu)

/** \brief 7BC, Read Data and Bit Flip Register 46 */
#define MTU_MC7_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BCu)

/** \brief 7BE, Read Data and Bit Flip Register 47 */
#define MTU_MC7_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617BEu)

/** \brief 7C0, Read Data and Bit Flip Register 48 */
#define MTU_MC7_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C0u)

/** \brief 7C2, Read Data and Bit Flip Register 49 */
#define MTU_MC7_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C2u)

/** \brief 7C4, Read Data and Bit Flip Register 50 */
#define MTU_MC7_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C4u)

/** \brief 7C6, Read Data and Bit Flip Register 51 */
#define MTU_MC7_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C6u)

/** \brief 7C8, Read Data and Bit Flip Register 52 */
#define MTU_MC7_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617C8u)

/** \brief 7CA, Read Data and Bit Flip Register 53 */
#define MTU_MC7_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CAu)

/** \brief 7CC, Read Data and Bit Flip Register 54 */
#define MTU_MC7_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CCu)

/** \brief 7CE, Read Data and Bit Flip Register 55 */
#define MTU_MC7_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617CEu)

/** \brief 7D0, Read Data and Bit Flip Register 56 */
#define MTU_MC7_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D0u)

/** \brief 7D2, Read Data and Bit Flip Register 57 */
#define MTU_MC7_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D2u)

/** \brief 7D4, Read Data and Bit Flip Register 58 */
#define MTU_MC7_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D4u)

/** \brief 7D6, Read Data and Bit Flip Register 59 */
#define MTU_MC7_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D6u)

/** \brief 7D8, Read Data and Bit Flip Register 60 */
#define MTU_MC7_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617D8u)

/** \brief 7DA, Read Data and Bit Flip Register 61 */
#define MTU_MC7_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DAu)

/** \brief 7DC, Read Data and Bit Flip Register 62 */
#define MTU_MC7_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DCu)

/** \brief 7DE, Read Data and Bit Flip Register 63 */
#define MTU_MC7_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617DEu)

/** \brief 7E0, Read Data and Bit Flip Register 64 */
#define MTU_MC7_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E0u)

/** \brief 7E2, Read Data and Bit Flip Register 65 */
#define MTU_MC7_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E2u)

/** \brief 7E4, Read Data and Bit Flip Register 66 */
#define MTU_MC7_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00617E4u)

/** \brief 7EE, Alarm Sources Configuration Register */
#define MTU_MC7_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00617EEu)

/** \brief 7F0, SSH Safety Faults Status Register  */
#define MTU_MC7_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00617F0u)

/** \brief 7F2, Error Information Register 0 */
#define MTU_MC7_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F2u)

/** \brief 7F4, Error Information Register 1 */
#define MTU_MC7_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F4u)

/** \brief 7F6, Error Information Register 2 */
#define MTU_MC7_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F6u)

/** \brief 7F8, Error Information Register 3 */
#define MTU_MC7_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617F8u)

/** \brief 7FA, Error Information Register 4 */
#define MTU_MC7_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00617FAu)

/** \brief 800, Configuration Registers */
#define MTU_MC8_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061800u)

