HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 8A6, Read Data and Bit Flip Register 35 */
#define MTU_MC8_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A6u)

/** \brief 8A8, Read Data and Bit Flip Register 36 */
#define MTU_MC8_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A8u)

/** \brief 8AA, Read Data and Bit Flip Register 37 */
#define MTU_MC8_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618AAu)

/** \brief 8AC, Read Data and Bit Flip Register 38 */
#define MTU_MC8_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618ACu)

/** \brief 8AE, Read Data and Bit Flip Register 39 */
#define MTU_MC8_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618AEu)

/** \brief 8B0, Read Data and Bit Flip Register 40 */
#define MTU_MC8_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B0u)

/** \brief 8B2, Read Data and Bit Flip Register 41 */
#define MTU_MC8_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B2u)

/** \brief 8B4, Read Data and Bit Flip Register 42 */
#define MTU_MC8_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B4u)

/** \brief 8B6, Read Data and Bit Flip Register 43 */
#define MTU_MC8_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B6u)

/** \brief 8B8, Read Data and Bit Flip Register 44 */
#define MTU_MC8_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618B8u)

/** \brief 8BA, Read Data and Bit Flip Register 45 */
#define MTU_MC8_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618BAu)

/** \brief 8BC, Read Data and Bit Flip Register 46 */
#define MTU_MC8_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618BCu)

/** \brief 8BE, Read Data and Bit Flip Register 47 */
#define MTU_MC8_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618BEu)

/** \brief 8C0, Read Data and Bit Flip Register 48 */
#define MTU_MC8_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C0u)

/** \brief 8C2, Read Data and Bit Flip Register 49 */
#define MTU_MC8_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C2u)

/** \brief 8C4, Read Data and Bit Flip Register 50 */
#define MTU_MC8_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C4u)

/** \brief 8C6, Read Data and Bit Flip Register 51 */
#define MTU_MC8_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C6u)

/** \brief 8C8, Read Data and Bit Flip Register 52 */
#define MTU_MC8_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618C8u)

/** \brief 8CA, Read Data and Bit Flip Register 53 */
#define MTU_MC8_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618CAu)

/** \brief 8CC, Read Data and Bit Flip Register 54 */
#define MTU_MC8_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618CCu)

/** \brief 8CE, Read Data and Bit Flip Register 55 */
#define MTU_MC8_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618CEu)

/** \brief 8D0, Read Data and Bit Flip Register 56 */
#define MTU_MC8_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D0u)

/** \brief 8D2, Read Data and Bit Flip Register 57 */
#define MTU_MC8_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D2u)

/** \brief 8D4, Read Data and Bit Flip Register 58 */
#define MTU_MC8_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D4u)

/** \brief 8D6, Read Data and Bit Flip Register 59 */
#define MTU_MC8_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D6u)

/** \brief 8D8, Read Data and Bit Flip Register 60 */
#define MTU_MC8_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618D8u)

/** \brief 8DA, Read Data and Bit Flip Register 61 */
#define MTU_MC8_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618DAu)

/** \brief 8DC, Read Data and Bit Flip Register 62 */
#define MTU_MC8_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618DCu)

/** \brief 8DE, Read Data and Bit Flip Register 63 */
#define MTU_MC8_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618DEu)

/** \brief 8E0, Read Data and Bit Flip Register 64 */
#define MTU_MC8_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618E0u)

/** \brief 8E2, Read Data and Bit Flip Register 65 */
#define MTU_MC8_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618E2u)

/** \brief 8E4, Read Data and Bit Flip Register 66 */
#define MTU_MC8_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618E4u)

/** \brief 8EE, Alarm Sources Configuration Register */
#define MTU_MC8_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00618EEu)

/** \brief 8F0, SSH Safety Faults Status Register  */
#define MTU_MC8_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00618F0u)

/** \brief 8F2, Error Information Register 0 */
#define MTU_MC8_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F2u)

/** \brief 8F4, Error Information Register 1 */
#define MTU_MC8_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F4u)

/** \brief 8F6, Error Information Register 2 */
#define MTU_MC8_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F6u)

/** \brief 8F8, Error Information Register 3 */
#define MTU_MC8_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618F8u)

/** \brief 8FA, Error Information Register 4 */
#define MTU_MC8_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00618FAu)

/** \brief 900, Configuration Registers */
#define MTU_MC9_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061900u)

/** \brief 902, Configuration Register 1 */
#define MTU_MC9_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061902u)

/** \brief 904, MBIST Control Register */
#define MTU_MC9_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061904u)

