HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief A66, Read Data and Bit Flip Register 3 */
#define MTU_MC10_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A66u)

/** \brief A68, Read Data and Bit Flip Register 4 */
#define MTU_MC10_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A68u)

/** \brief A6A, Read Data and Bit Flip Register 5 */
#define MTU_MC10_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Au)

/** \brief A6C, Read Data and Bit Flip Register 6 */
#define MTU_MC10_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Cu)

/** \brief A6E, Read Data and Bit Flip Register 7 */
#define MTU_MC10_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A6Eu)

/** \brief A70, Read Data and Bit Flip Register 8 */
#define MTU_MC10_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A70u)

/** \brief A72, Read Data and Bit Flip Register 9 */
#define MTU_MC10_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A72u)

/** \brief A74, Read Data and Bit Flip Register 10 */
#define MTU_MC10_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A74u)

/** \brief A76, Read Data and Bit Flip Register 11 */
#define MTU_MC10_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A76u)

/** \brief A78, Read Data and Bit Flip Register 12 */
#define MTU_MC10_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A78u)

/** \brief A7A, Read Data and Bit Flip Register 13 */
#define MTU_MC10_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Au)

/** \brief A7C, Read Data and Bit Flip Register 14 */
#define MTU_MC10_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Cu)

/** \brief A7E, Read Data and Bit Flip Register 15 */
#define MTU_MC10_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A7Eu)

/** \brief A80, Read Data and Bit Flip Register 16 */
#define MTU_MC10_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A80u)

/** \brief A82, Read Data and Bit Flip Register 17 */
#define MTU_MC10_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A82u)

/** \brief A84, Read Data and Bit Flip Register 18 */
#define MTU_MC10_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A84u)

/** \brief A86, Read Data and Bit Flip Register 19 */
#define MTU_MC10_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A86u)

/** \brief A88, Read Data and Bit Flip Register 20 */
#define MTU_MC10_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A88u)

/** \brief A8A, Read Data and Bit Flip Register 21 */
#define MTU_MC10_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Au)

/** \brief A8C, Read Data and Bit Flip Register 22 */
#define MTU_MC10_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Cu)

/** \brief A8E, Read Data and Bit Flip Register 23 */
#define MTU_MC10_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A8Eu)

/** \brief A90, Read Data and Bit Flip Register 24 */
#define MTU_MC10_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A90u)

/** \brief A92, Read Data and Bit Flip Register 25 */
#define MTU_MC10_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A92u)

/** \brief A94, Read Data and Bit Flip Register 26 */
#define MTU_MC10_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A94u)

/** \brief A96, Read Data and Bit Flip Register 27 */
#define MTU_MC10_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A96u)

/** \brief A98, Read Data and Bit Flip Register 28 */
#define MTU_MC10_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A98u)

/** \brief A9A, Read Data and Bit Flip Register 29 */
#define MTU_MC10_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Au)

/** \brief A9C, Read Data and Bit Flip Register 30 */
#define MTU_MC10_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Cu)

/** \brief A9E, Read Data and Bit Flip Register 31 */
#define MTU_MC10_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Eu)

/** \brief AA0, Read Data and Bit Flip Register 32 */
#define MTU_MC10_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA0u)

/** \brief AA2, Read Data and Bit Flip Register 33 */
#define MTU_MC10_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA2u)

/** \brief AA4, Read Data and Bit Flip Register 34 */
#define MTU_MC10_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA4u)

/** \brief AA6, Read Data and Bit Flip Register 35 */
#define MTU_MC10_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA6u)

/** \brief AA8, Read Data and Bit Flip Register 36 */
#define MTU_MC10_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA8u)

/** \brief AAA, Read Data and Bit Flip Register 37 */
#define MTU_MC10_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AAAu)

/** \brief AAC, Read Data and Bit Flip Register 38 */
#define MTU_MC10_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AACu)

/** \brief AAE, Read Data and Bit Flip Register 39 */
#define MTU_MC10_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AAEu)

/** \brief AB0, Read Data and Bit Flip Register 40 */
#define MTU_MC10_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB0u)

/** \brief AB2, Read Data and Bit Flip Register 41 */
#define MTU_MC10_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB2u)

/** \brief AB4, Read Data and Bit Flip Register 42 */
#define MTU_MC10_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB4u)

/** \brief AB6, Read Data and Bit Flip Register 43 */
#define MTU_MC10_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB6u)

/** \brief AB8, Read Data and Bit Flip Register 44 */
#define MTU_MC10_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB8u)

/** \brief ABA, Read Data and Bit Flip Register 45 */
#define MTU_MC10_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABAu)

/** \brief ABC, Read Data and Bit Flip Register 46 */
#define MTU_MC10_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABCu)

/** \brief ABE, Read Data and Bit Flip Register 47 */
#define MTU_MC10_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABEu)

/** \brief AC0, Read Data and Bit Flip Register 48 */
#define MTU_MC10_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC0u)

/** \brief AC2, Read Data and Bit Flip Register 49 */
#define MTU_MC10_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC2u)

/** \brief AC4, Read Data and Bit Flip Register 50 */
#define MTU_MC10_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC4u)

/** \brief AC6, Read Data and Bit Flip Register 51 */
#define MTU_MC10_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC6u)

/** \brief AC8, Read Data and Bit Flip Register 52 */
#define MTU_MC10_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC8u)

/** \brief ACA, Read Data and Bit Flip Register 53 */
#define MTU_MC10_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ACAu)

