HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 21B6, Read Data and Bit Flip Register 43 */
#define MTU_MC33_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B6u)

/** \brief 21B8, Read Data and Bit Flip Register 44 */
#define MTU_MC33_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B8u)

/** \brief 21BA, Read Data and Bit Flip Register 45 */
#define MTU_MC33_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631BAu)

/** \brief 21BC, Read Data and Bit Flip Register 46 */
#define MTU_MC33_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631BCu)

/** \brief 21BE, Read Data and Bit Flip Register 47 */
#define MTU_MC33_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631BEu)

/** \brief 21C0, Read Data and Bit Flip Register 48 */
#define MTU_MC33_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C0u)

/** \brief 21C2, Read Data and Bit Flip Register 49 */
#define MTU_MC33_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C2u)

/** \brief 21C4, Read Data and Bit Flip Register 50 */
#define MTU_MC33_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C4u)

/** \brief 21C6, Read Data and Bit Flip Register 51 */
#define MTU_MC33_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C6u)

/** \brief 21C8, Read Data and Bit Flip Register 52 */
#define MTU_MC33_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631C8u)

/** \brief 21CA, Read Data and Bit Flip Register 53 */
#define MTU_MC33_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631CAu)

/** \brief 21CC, Read Data and Bit Flip Register 54 */
#define MTU_MC33_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631CCu)

/** \brief 21CE, Read Data and Bit Flip Register 55 */
#define MTU_MC33_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631CEu)

/** \brief 21D0, Read Data and Bit Flip Register 56 */
#define MTU_MC33_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D0u)

/** \brief 21D2, Read Data and Bit Flip Register 57 */
#define MTU_MC33_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D2u)

/** \brief 21D4, Read Data and Bit Flip Register 58 */
#define MTU_MC33_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D4u)

/** \brief 21D6, Read Data and Bit Flip Register 59 */
#define MTU_MC33_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D6u)

/** \brief 21D8, Read Data and Bit Flip Register 60 */
#define MTU_MC33_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631D8u)

/** \brief 21DA, Read Data and Bit Flip Register 61 */
#define MTU_MC33_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631DAu)

/** \brief 21DC, Read Data and Bit Flip Register 62 */
#define MTU_MC33_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631DCu)

/** \brief 21DE, Read Data and Bit Flip Register 63 */
#define MTU_MC33_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631DEu)

/** \brief 21E0, Read Data and Bit Flip Register 64 */
#define MTU_MC33_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631E0u)

/** \brief 21E2, Read Data and Bit Flip Register 65 */
#define MTU_MC33_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631E2u)

/** \brief 21E4, Read Data and Bit Flip Register 66 */
#define MTU_MC33_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631E4u)

/** \brief 21EE, Alarm Sources Configuration Register */
#define MTU_MC33_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00631EEu)

/** \brief 21F0, SSH Safety Faults Status Register  */
#define MTU_MC33_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00631F0u)

/** \brief 21F2, Error Information Register 0 */
#define MTU_MC33_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F2u)

/** \brief 21F4, Error Information Register 1 */
#define MTU_MC33_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F4u)

/** \brief 21F6, Error Information Register 2 */
#define MTU_MC33_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F6u)

/** \brief 21F8, Error Information Register 3 */
#define MTU_MC33_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631F8u)

/** \brief 21FA, Error Information Register 4 */
#define MTU_MC33_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00631FAu)

/** \brief 2200, Configuration Registers */
#define MTU_MC34_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063200u)

/** \brief 2202, Configuration Register 1 */
#define MTU_MC34_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063202u)

/** \brief 2204, MBIST Control Register */
#define MTU_MC34_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063204u)

/** \brief 2206, Status Register */
#define MTU_MC34_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063206u)

/** \brief 2208, Range Register, single address mode */
#define MTU_MC34_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063208u)

/** \brief 220C, Revision ID Register */
#define MTU_MC34_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006320Cu)

/** \brief 220E, ECC Safety Register */
#define MTU_MC34_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006320Eu)

/** \brief 2210, Memory ECC Detection Register */
#define MTU_MC34_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063210u)

/** \brief 2212, Error Tracking Register 0 */
#define MTU_MC34_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063212u)

/** \brief 2214, Error Tracking Register 1 */
#define MTU_MC34_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063214u)

/** \brief 2216, Error Tracking Register 2 */
#define MTU_MC34_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063216u)

