HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 2218, Error Tracking Register 3 */
#define MTU_MC34_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063218u)

/** \brief 221A, Error Tracking Register 4 */
#define MTU_MC34_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006321Au)

/** \brief 2260, Read Data and Bit Flip Register 0 */
#define MTU_MC34_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063260u)

/** \brief 2262, Read Data and Bit Flip Register 1 */
#define MTU_MC34_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063262u)

/** \brief 2264, Read Data and Bit Flip Register 2 */
#define MTU_MC34_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063264u)

/** \brief 2266, Read Data and Bit Flip Register 3 */
#define MTU_MC34_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063266u)

/** \brief 2268, Read Data and Bit Flip Register 4 */
#define MTU_MC34_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063268u)

/** \brief 226A, Read Data and Bit Flip Register 5 */
#define MTU_MC34_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006326Au)

/** \brief 226C, Read Data and Bit Flip Register 6 */
#define MTU_MC34_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006326Cu)

/** \brief 226E, Read Data and Bit Flip Register 7 */
#define MTU_MC34_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006326Eu)

/** \brief 2270, Read Data and Bit Flip Register 8 */
#define MTU_MC34_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063270u)

/** \brief 2272, Read Data and Bit Flip Register 9 */
#define MTU_MC34_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063272u)

/** \brief 2274, Read Data and Bit Flip Register 10 */
#define MTU_MC34_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063274u)

/** \brief 2276, Read Data and Bit Flip Register 11 */
#define MTU_MC34_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063276u)

/** \brief 2278, Read Data and Bit Flip Register 12 */
#define MTU_MC34_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063278u)

/** \brief 227A, Read Data and Bit Flip Register 13 */
#define MTU_MC34_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006327Au)

/** \brief 227C, Read Data and Bit Flip Register 14 */
#define MTU_MC34_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006327Cu)

/** \brief 227E, Read Data and Bit Flip Register 15 */
#define MTU_MC34_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006327Eu)

/** \brief 2280, Read Data and Bit Flip Register 16 */
#define MTU_MC34_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063280u)

/** \brief 2282, Read Data and Bit Flip Register 17 */
#define MTU_MC34_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063282u)

/** \brief 2284, Read Data and Bit Flip Register 18 */
#define MTU_MC34_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063284u)

/** \brief 2286, Read Data and Bit Flip Register 19 */
#define MTU_MC34_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063286u)

/** \brief 2288, Read Data and Bit Flip Register 20 */
#define MTU_MC34_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063288u)

/** \brief 228A, Read Data and Bit Flip Register 21 */
#define MTU_MC34_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006328Au)

/** \brief 228C, Read Data and Bit Flip Register 22 */
#define MTU_MC34_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006328Cu)

/** \brief 228E, Read Data and Bit Flip Register 23 */
#define MTU_MC34_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006328Eu)

/** \brief 2290, Read Data and Bit Flip Register 24 */
#define MTU_MC34_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063290u)

/** \brief 2292, Read Data and Bit Flip Register 25 */
#define MTU_MC34_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063292u)

/** \brief 2294, Read Data and Bit Flip Register 26 */
#define MTU_MC34_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063294u)

/** \brief 2296, Read Data and Bit Flip Register 27 */
#define MTU_MC34_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063296u)

/** \brief 2298, Read Data and Bit Flip Register 28 */
#define MTU_MC34_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063298u)

/** \brief 229A, Read Data and Bit Flip Register 29 */
#define MTU_MC34_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006329Au)

/** \brief 229C, Read Data and Bit Flip Register 30 */
#define MTU_MC34_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006329Cu)

/** \brief 229E, Read Data and Bit Flip Register 31 */
#define MTU_MC34_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006329Eu)

/** \brief 22A0, Read Data and Bit Flip Register 32 */
#define MTU_MC34_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A0u)

/** \brief 22A2, Read Data and Bit Flip Register 33 */
#define MTU_MC34_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A2u)

/** \brief 22A4, Read Data and Bit Flip Register 34 */
#define MTU_MC34_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A4u)

/** \brief 22A6, Read Data and Bit Flip Register 35 */
#define MTU_MC34_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A6u)

/** \brief 22A8, Read Data and Bit Flip Register 36 */
#define MTU_MC34_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632A8u)

/** \brief 22AA, Read Data and Bit Flip Register 37 */
#define MTU_MC34_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632AAu)

/** \brief 22AC, Read Data and Bit Flip Register 38 */
#define MTU_MC34_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00632ACu)

