HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 27F4, Error Information Register 1 */
#define MTU_MC39_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F4u)

/** \brief 27F6, Error Information Register 2 */
#define MTU_MC39_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F6u)

/** \brief 27F8, Error Information Register 3 */
#define MTU_MC39_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637F8u)

/** \brief 27FA, Error Information Register 4 */
#define MTU_MC39_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00637FAu)

/** \brief 2800, Configuration Registers */
#define MTU_MC40_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063800u)

/** \brief 2802, Configuration Register 1 */
#define MTU_MC40_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063802u)

/** \brief 2804, MBIST Control Register */
#define MTU_MC40_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063804u)

/** \brief 2806, Status Register */
#define MTU_MC40_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063806u)

/** \brief 2808, Range Register, single address mode */
#define MTU_MC40_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063808u)

/** \brief 280C, Revision ID Register */
#define MTU_MC40_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006380Cu)

/** \brief 280E, ECC Safety Register */
#define MTU_MC40_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006380Eu)

/** \brief 2810, Memory ECC Detection Register */
#define MTU_MC40_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063810u)

/** \brief 2812, Error Tracking Register 0 */
#define MTU_MC40_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063812u)

/** \brief 2814, Error Tracking Register 1 */
#define MTU_MC40_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063814u)

/** \brief 2816, Error Tracking Register 2 */
#define MTU_MC40_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063816u)

/** \brief 2818, Error Tracking Register 3 */
#define MTU_MC40_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063818u)

/** \brief 281A, Error Tracking Register 4 */
#define MTU_MC40_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006381Au)

/** \brief 2860, Read Data and Bit Flip Register 0 */
#define MTU_MC40_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063860u)

/** \brief 2862, Read Data and Bit Flip Register 1 */
#define MTU_MC40_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063862u)

/** \brief 2864, Read Data and Bit Flip Register 2 */
#define MTU_MC40_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063864u)

/** \brief 2866, Read Data and Bit Flip Register 3 */
#define MTU_MC40_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063866u)

/** \brief 2868, Read Data and Bit Flip Register 4 */
#define MTU_MC40_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063868u)

/** \brief 286A, Read Data and Bit Flip Register 5 */
#define MTU_MC40_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006386Au)

/** \brief 286C, Read Data and Bit Flip Register 6 */
#define MTU_MC40_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006386Cu)

/** \brief 286E, Read Data and Bit Flip Register 7 */
#define MTU_MC40_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006386Eu)

/** \brief 2870, Read Data and Bit Flip Register 8 */
#define MTU_MC40_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063870u)

/** \brief 2872, Read Data and Bit Flip Register 9 */
#define MTU_MC40_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063872u)

/** \brief 2874, Read Data and Bit Flip Register 10 */
#define MTU_MC40_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063874u)

/** \brief 2876, Read Data and Bit Flip Register 11 */
#define MTU_MC40_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063876u)

/** \brief 2878, Read Data and Bit Flip Register 12 */
#define MTU_MC40_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063878u)

/** \brief 287A, Read Data and Bit Flip Register 13 */
#define MTU_MC40_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006387Au)

/** \brief 287C, Read Data and Bit Flip Register 14 */
#define MTU_MC40_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006387Cu)

/** \brief 287E, Read Data and Bit Flip Register 15 */
#define MTU_MC40_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006387Eu)

/** \brief 2880, Read Data and Bit Flip Register 16 */
#define MTU_MC40_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063880u)

/** \brief 2882, Read Data and Bit Flip Register 17 */
#define MTU_MC40_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063882u)

/** \brief 2884, Read Data and Bit Flip Register 18 */
#define MTU_MC40_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063884u)

/** \brief 2886, Read Data and Bit Flip Register 19 */
#define MTU_MC40_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063886u)

/** \brief 2888, Read Data and Bit Flip Register 20 */
#define MTU_MC40_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063888u)

/** \brief 288A, Read Data and Bit Flip Register 21 */
#define MTU_MC40_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006388Au)

/** \brief 288C, Read Data and Bit Flip Register 22 */
#define MTU_MC40_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006388Cu)

/** \brief 288E, Read Data and Bit Flip Register 23 */
#define MTU_MC40_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006388Eu)

/** \brief 2890, Read Data and Bit Flip Register 24 */
#define MTU_MC40_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063890u)

/** \brief 2892, Read Data and Bit Flip Register 25 */
#define MTU_MC40_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063892u)

/** \brief 2894, Read Data and Bit Flip Register 26 */
#define MTU_MC40_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063894u)

/** \brief 2896, Read Data and Bit Flip Register 27 */
#define MTU_MC40_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063896u)

