HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 31C8, Read Data and Bit Flip Register 52 */
#define MTU_MC49_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C8u)

/** \brief 31CA, Read Data and Bit Flip Register 53 */
#define MTU_MC49_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641CAu)

/** \brief 31CC, Read Data and Bit Flip Register 54 */
#define MTU_MC49_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641CCu)

/** \brief 31CE, Read Data and Bit Flip Register 55 */
#define MTU_MC49_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641CEu)

/** \brief 31D0, Read Data and Bit Flip Register 56 */
#define MTU_MC49_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D0u)

/** \brief 31D2, Read Data and Bit Flip Register 57 */
#define MTU_MC49_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D2u)

/** \brief 31D4, Read Data and Bit Flip Register 58 */
#define MTU_MC49_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D4u)

/** \brief 31D6, Read Data and Bit Flip Register 59 */
#define MTU_MC49_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D6u)

/** \brief 31D8, Read Data and Bit Flip Register 60 */
#define MTU_MC49_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641D8u)

/** \brief 31DA, Read Data and Bit Flip Register 61 */
#define MTU_MC49_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641DAu)

/** \brief 31DC, Read Data and Bit Flip Register 62 */
#define MTU_MC49_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641DCu)

/** \brief 31DE, Read Data and Bit Flip Register 63 */
#define MTU_MC49_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641DEu)

/** \brief 31E0, Read Data and Bit Flip Register 64 */
#define MTU_MC49_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641E0u)

/** \brief 31E2, Read Data and Bit Flip Register 65 */
#define MTU_MC49_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641E2u)

/** \brief 31E4, Read Data and Bit Flip Register 66 */
#define MTU_MC49_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641E4u)

/** \brief 31EE, Alarm Sources Configuration Register */
#define MTU_MC49_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00641EEu)

/** \brief 31F0, SSH Safety Faults Status Register  */
#define MTU_MC49_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00641F0u)

/** \brief 31F2, Error Information Register 0 */
#define MTU_MC49_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F2u)

/** \brief 31F4, Error Information Register 1 */
#define MTU_MC49_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F4u)

/** \brief 31F6, Error Information Register 2 */
#define MTU_MC49_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F6u)

/** \brief 31F8, Error Information Register 3 */
#define MTU_MC49_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641F8u)

/** \brief 31FA, Error Information Register 4 */
#define MTU_MC49_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00641FAu)

/** \brief 3200, Configuration Registers */
#define MTU_MC50_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064200u)

/** \brief 3202, Configuration Register 1 */
#define MTU_MC50_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064202u)

/** \brief 3204, MBIST Control Register */
#define MTU_MC50_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064204u)

/** \brief 3206, Status Register */
#define MTU_MC50_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064206u)

/** \brief 3208, Range Register, single address mode */
#define MTU_MC50_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064208u)

/** \brief 320C, Revision ID Register */
#define MTU_MC50_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006420Cu)

/** \brief 320E, ECC Safety Register */
#define MTU_MC50_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006420Eu)

/** \brief 3210, Memory ECC Detection Register */
#define MTU_MC50_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064210u)

/** \brief 3212, Error Tracking Register 0 */
#define MTU_MC50_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064212u)

/** \brief 3214, Error Tracking Register 1 */
#define MTU_MC50_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064214u)

/** \brief 3216, Error Tracking Register 2 */
#define MTU_MC50_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064216u)

/** \brief 3218, Error Tracking Register 3 */
#define MTU_MC50_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064218u)

/** \brief 321A, Error Tracking Register 4 */
#define MTU_MC50_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006421Au)

/** \brief 3260, Read Data and Bit Flip Register 0 */
#define MTU_MC50_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064260u)

/** \brief 3262, Read Data and Bit Flip Register 1 */
#define MTU_MC50_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064262u)

/** \brief 3264, Read Data and Bit Flip Register 2 */
#define MTU_MC50_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064264u)

/** \brief 3266, Read Data and Bit Flip Register 3 */
#define MTU_MC50_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064266u)

/** \brief 3268, Read Data and Bit Flip Register 4 */
#define MTU_MC50_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064268u)

/** \brief 326A, Read Data and Bit Flip Register 5 */
#define MTU_MC50_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006426Au)

/** \brief 326C, Read Data and Bit Flip Register 6 */
#define MTU_MC50_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006426Cu)

/** \brief 326E, Read Data and Bit Flip Register 7 */
#define MTU_MC50_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006426Eu)

/** \brief 3270, Read Data and Bit Flip Register 8 */
#define MTU_MC50_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064270u)

/** \brief 3272, Read Data and Bit Flip Register 9 */
#define MTU_MC50_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064272u)

/** \brief 3274, Read Data and Bit Flip Register 10 */
#define MTU_MC50_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064274u)

/** \brief 3276, Read Data and Bit Flip Register 11 */
#define MTU_MC50_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064276u)

