HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 3494, Read Data and Bit Flip Register 26 */
#define MTU_MC52_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064494u)

/** \brief 3496, Read Data and Bit Flip Register 27 */
#define MTU_MC52_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064496u)

/** \brief 3498, Read Data and Bit Flip Register 28 */
#define MTU_MC52_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064498u)

/** \brief 349A, Read Data and Bit Flip Register 29 */
#define MTU_MC52_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006449Au)

/** \brief 349C, Read Data and Bit Flip Register 30 */
#define MTU_MC52_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006449Cu)

/** \brief 349E, Read Data and Bit Flip Register 31 */
#define MTU_MC52_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006449Eu)

/** \brief 34A0, Read Data and Bit Flip Register 32 */
#define MTU_MC52_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A0u)

/** \brief 34A2, Read Data and Bit Flip Register 33 */
#define MTU_MC52_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A2u)

/** \brief 34A4, Read Data and Bit Flip Register 34 */
#define MTU_MC52_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A4u)

/** \brief 34A6, Read Data and Bit Flip Register 35 */
#define MTU_MC52_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A6u)

/** \brief 34A8, Read Data and Bit Flip Register 36 */
#define MTU_MC52_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644A8u)

/** \brief 34AA, Read Data and Bit Flip Register 37 */
#define MTU_MC52_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644AAu)

/** \brief 34AC, Read Data and Bit Flip Register 38 */
#define MTU_MC52_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644ACu)

/** \brief 34AE, Read Data and Bit Flip Register 39 */
#define MTU_MC52_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644AEu)

/** \brief 34B0, Read Data and Bit Flip Register 40 */
#define MTU_MC52_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B0u)

/** \brief 34B2, Read Data and Bit Flip Register 41 */
#define MTU_MC52_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B2u)

/** \brief 34B4, Read Data and Bit Flip Register 42 */
#define MTU_MC52_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B4u)

/** \brief 34B6, Read Data and Bit Flip Register 43 */
#define MTU_MC52_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B6u)

/** \brief 34B8, Read Data and Bit Flip Register 44 */
#define MTU_MC52_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644B8u)

/** \brief 34BA, Read Data and Bit Flip Register 45 */
#define MTU_MC52_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644BAu)

/** \brief 34BC, Read Data and Bit Flip Register 46 */
#define MTU_MC52_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644BCu)

/** \brief 34BE, Read Data and Bit Flip Register 47 */
#define MTU_MC52_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644BEu)

/** \brief 34C0, Read Data and Bit Flip Register 48 */
#define MTU_MC52_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C0u)

/** \brief 34C2, Read Data and Bit Flip Register 49 */
#define MTU_MC52_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C2u)

/** \brief 34C4, Read Data and Bit Flip Register 50 */
#define MTU_MC52_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C4u)

/** \brief 34C6, Read Data and Bit Flip Register 51 */
#define MTU_MC52_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C6u)

/** \brief 34C8, Read Data and Bit Flip Register 52 */
#define MTU_MC52_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644C8u)

/** \brief 34CA, Read Data and Bit Flip Register 53 */
#define MTU_MC52_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644CAu)

/** \brief 34CC, Read Data and Bit Flip Register 54 */
#define MTU_MC52_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644CCu)

/** \brief 34CE, Read Data and Bit Flip Register 55 */
#define MTU_MC52_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644CEu)

/** \brief 34D0, Read Data and Bit Flip Register 56 */
#define MTU_MC52_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D0u)

/** \brief 34D2, Read Data and Bit Flip Register 57 */
#define MTU_MC52_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D2u)

/** \brief 34D4, Read Data and Bit Flip Register 58 */
#define MTU_MC52_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D4u)

/** \brief 34D6, Read Data and Bit Flip Register 59 */
#define MTU_MC52_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D6u)

/** \brief 34D8, Read Data and Bit Flip Register 60 */
#define MTU_MC52_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644D8u)

/** \brief 34DA, Read Data and Bit Flip Register 61 */
#define MTU_MC52_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644DAu)

/** \brief 34DC, Read Data and Bit Flip Register 62 */
#define MTU_MC52_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644DCu)

/** \brief 34DE, Read Data and Bit Flip Register 63 */
#define MTU_MC52_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644DEu)

/** \brief 34E0, Read Data and Bit Flip Register 64 */
#define MTU_MC52_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644E0u)

/** \brief 34E2, Read Data and Bit Flip Register 65 */
#define MTU_MC52_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644E2u)

/** \brief 34E4, Read Data and Bit Flip Register 66 */
#define MTU_MC52_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00644E4u)

/** \brief 34EE, Alarm Sources Configuration Register */
#define MTU_MC52_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00644EEu)

/** \brief 34F0, SSH Safety Faults Status Register  */
#define MTU_MC52_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00644F0u)

