HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 3798, Read Data and Bit Flip Register 28 */
#define MTU_MC55_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064798u)

/** \brief 379A, Read Data and Bit Flip Register 29 */
#define MTU_MC55_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006479Au)

/** \brief 379C, Read Data and Bit Flip Register 30 */
#define MTU_MC55_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006479Cu)

/** \brief 379E, Read Data and Bit Flip Register 31 */
#define MTU_MC55_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006479Eu)

/** \brief 37A0, Read Data and Bit Flip Register 32 */
#define MTU_MC55_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A0u)

/** \brief 37A2, Read Data and Bit Flip Register 33 */
#define MTU_MC55_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A2u)

/** \brief 37A4, Read Data and Bit Flip Register 34 */
#define MTU_MC55_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A4u)

/** \brief 37A6, Read Data and Bit Flip Register 35 */
#define MTU_MC55_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A6u)

/** \brief 37A8, Read Data and Bit Flip Register 36 */
#define MTU_MC55_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647A8u)

/** \brief 37AA, Read Data and Bit Flip Register 37 */
#define MTU_MC55_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647AAu)

/** \brief 37AC, Read Data and Bit Flip Register 38 */
#define MTU_MC55_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647ACu)

/** \brief 37AE, Read Data and Bit Flip Register 39 */
#define MTU_MC55_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647AEu)

/** \brief 37B0, Read Data and Bit Flip Register 40 */
#define MTU_MC55_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B0u)

/** \brief 37B2, Read Data and Bit Flip Register 41 */
#define MTU_MC55_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B2u)

/** \brief 37B4, Read Data and Bit Flip Register 42 */
#define MTU_MC55_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B4u)

/** \brief 37B6, Read Data and Bit Flip Register 43 */
#define MTU_MC55_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B6u)

/** \brief 37B8, Read Data and Bit Flip Register 44 */
#define MTU_MC55_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647B8u)

/** \brief 37BA, Read Data and Bit Flip Register 45 */
#define MTU_MC55_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647BAu)

/** \brief 37BC, Read Data and Bit Flip Register 46 */
#define MTU_MC55_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647BCu)

/** \brief 37BE, Read Data and Bit Flip Register 47 */
#define MTU_MC55_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647BEu)

/** \brief 37C0, Read Data and Bit Flip Register 48 */
#define MTU_MC55_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C0u)

/** \brief 37C2, Read Data and Bit Flip Register 49 */
#define MTU_MC55_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C2u)

/** \brief 37C4, Read Data and Bit Flip Register 50 */
#define MTU_MC55_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C4u)

/** \brief 37C6, Read Data and Bit Flip Register 51 */
#define MTU_MC55_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C6u)

/** \brief 37C8, Read Data and Bit Flip Register 52 */
#define MTU_MC55_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647C8u)

/** \brief 37CA, Read Data and Bit Flip Register 53 */
#define MTU_MC55_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647CAu)

/** \brief 37CC, Read Data and Bit Flip Register 54 */
#define MTU_MC55_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647CCu)

/** \brief 37CE, Read Data and Bit Flip Register 55 */
#define MTU_MC55_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647CEu)

/** \brief 37D0, Read Data and Bit Flip Register 56 */
#define MTU_MC55_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D0u)

/** \brief 37D2, Read Data and Bit Flip Register 57 */
#define MTU_MC55_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D2u)

/** \brief 37D4, Read Data and Bit Flip Register 58 */
#define MTU_MC55_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D4u)

/** \brief 37D6, Read Data and Bit Flip Register 59 */
#define MTU_MC55_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D6u)

/** \brief 37D8, Read Data and Bit Flip Register 60 */
#define MTU_MC55_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647D8u)

/** \brief 37DA, Read Data and Bit Flip Register 61 */
#define MTU_MC55_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647DAu)

/** \brief 37DC, Read Data and Bit Flip Register 62 */
#define MTU_MC55_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647DCu)

/** \brief 37DE, Read Data and Bit Flip Register 63 */
#define MTU_MC55_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647DEu)

/** \brief 37E0, Read Data and Bit Flip Register 64 */
#define MTU_MC55_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647E0u)

/** \brief 37E2, Read Data and Bit Flip Register 65 */
#define MTU_MC55_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647E2u)

/** \brief 37E4, Read Data and Bit Flip Register 66 */
#define MTU_MC55_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00647E4u)

/** \brief 37EE, Alarm Sources Configuration Register */
#define MTU_MC55_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00647EEu)

/** \brief 37F0, SSH Safety Faults Status Register  */
#define MTU_MC55_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00647F0u)

/** \brief 37F2, Error Information Register 0 */
#define MTU_MC55_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F2u)

/** \brief 37F4, Error Information Register 1 */
#define MTU_MC55_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F4u)

/** \brief 37F6, Error Information Register 2 */
#define MTU_MC55_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F6u)

/** \brief 37F8, Error Information Register 3 */
#define MTU_MC55_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647F8u)

/** \brief 37FA, Error Information Register 4 */
#define MTU_MC55_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00647FAu)

/** \brief 3800, Configuration Registers */
#define MTU_MC56_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064800u)

/** \brief 3802, Configuration Register 1 */
#define MTU_MC56_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064802u)

/** \brief 3804, MBIST Control Register */
#define MTU_MC56_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064804u)

/** \brief 3806, Status Register */
#define MTU_MC56_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064806u)

/** \brief 3808, Range Register, single address mode */
#define MTU_MC56_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064808u)

/** \brief 380C, Revision ID Register */
#define MTU_MC56_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006480Cu)

/** \brief 380E, ECC Safety Register */
#define MTU_MC56_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006480Eu)

/** \brief 3810, Memory ECC Detection Register */
#define MTU_MC56_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064810u)

/** \brief 3812, Error Tracking Register 0 */
#define MTU_MC56_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064812u)

/** \brief 3814, Error Tracking Register 1 */
#define MTU_MC56_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064814u)

/** \brief 3816, Error Tracking Register 2 */
#define MTU_MC56_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064816u)

/** \brief 3818, Error Tracking Register 3 */
#define MTU_MC56_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064818u)

/** \brief 381A, Error Tracking Register 4 */
#define MTU_MC56_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006481Au)

/** \brief 3860, Read Data and Bit Flip Register 0 */
#define MTU_MC56_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064860u)

/** \brief 3862, Read Data and Bit Flip Register 1 */
#define MTU_MC56_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064862u)

/** \brief 3864, Read Data and Bit Flip Register 2 */
#define MTU_MC56_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064864u)

