HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 53CC, Read Data and Bit Flip Register 54 */
#define MTU_MC83_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663CCu)

/** \brief 53CE, Read Data and Bit Flip Register 55 */
#define MTU_MC83_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663CEu)

/** \brief 53D0, Read Data and Bit Flip Register 56 */
#define MTU_MC83_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663D0u)

/** \brief 53D2, Read Data and Bit Flip Register 57 */
#define MTU_MC83_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663D2u)

/** \brief 53D4, Read Data and Bit Flip Register 58 */
#define MTU_MC83_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663D4u)

/** \brief 53D6, Read Data and Bit Flip Register 59 */
#define MTU_MC83_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663D6u)

/** \brief 53D8, Read Data and Bit Flip Register 60 */
#define MTU_MC83_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663D8u)

/** \brief 53DA, Read Data and Bit Flip Register 61 */
#define MTU_MC83_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663DAu)

/** \brief 53DC, Read Data and Bit Flip Register 62 */
#define MTU_MC83_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663DCu)

/** \brief 53DE, Read Data and Bit Flip Register 63 */
#define MTU_MC83_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663DEu)

/** \brief 53E0, Read Data and Bit Flip Register 64 */
#define MTU_MC83_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663E0u)

/** \brief 53E2, Read Data and Bit Flip Register 65 */
#define MTU_MC83_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663E2u)

/** \brief 53E4, Read Data and Bit Flip Register 66 */
#define MTU_MC83_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00663E4u)

/** \brief 53EE, Alarm Sources Configuration Register */
#define MTU_MC83_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00663EEu)

/** \brief 53F0, SSH Safety Faults Status Register  */
#define MTU_MC83_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00663F0u)

/** \brief 53F2, Error Information Register 0 */
#define MTU_MC83_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00663F2u)

/** \brief 53F4, Error Information Register 1 */
#define MTU_MC83_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00663F4u)

/** \brief 53F6, Error Information Register 2 */
#define MTU_MC83_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00663F6u)

/** \brief 53F8, Error Information Register 3 */
#define MTU_MC83_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00663F8u)

/** \brief 53FA, Error Information Register 4 */
#define MTU_MC83_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00663FAu)

/** \brief 5400, Configuration Registers */
#define MTU_MC84_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066400u)

/** \brief 5402, Configuration Register 1 */
#define MTU_MC84_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066402u)

/** \brief 5404, MBIST Control Register */
#define MTU_MC84_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066404u)

/** \brief 5406, Status Register */
#define MTU_MC84_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066406u)

/** \brief 5408, Range Register, single address mode */
#define MTU_MC84_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066408u)

/** \brief 540C, Revision ID Register */
#define MTU_MC84_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006640Cu)

/** \brief 540E, ECC Safety Register */
#define MTU_MC84_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006640Eu)

/** \brief 5410, Memory ECC Detection Register */
#define MTU_MC84_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066410u)

/** \brief 5412, Error Tracking Register 0 */
#define MTU_MC84_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066412u)

/** \brief 5414, Error Tracking Register 1 */
#define MTU_MC84_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066414u)

/** \brief 5416, Error Tracking Register 2 */
#define MTU_MC84_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066416u)

/** \brief 5418, Error Tracking Register 3 */
#define MTU_MC84_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066418u)

/** \brief 541A, Error Tracking Register 4 */
#define MTU_MC84_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006641Au)

/** \brief 5460, Read Data and Bit Flip Register 0 */
#define MTU_MC84_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066460u)

/** \brief 5462, Read Data and Bit Flip Register 1 */
#define MTU_MC84_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066462u)

/** \brief 5464, Read Data and Bit Flip Register 2 */
#define MTU_MC84_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066464u)

/** \brief 5466, Read Data and Bit Flip Register 3 */
#define MTU_MC84_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066466u)

/** \brief 5468, Read Data and Bit Flip Register 4 */
#define MTU_MC84_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066468u)

/** \brief 546A, Read Data and Bit Flip Register 5 */
#define MTU_MC84_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006646Au)

/** \brief 546C, Read Data and Bit Flip Register 6 */
#define MTU_MC84_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006646Cu)

/** \brief 546E, Read Data and Bit Flip Register 7 */
#define MTU_MC84_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006646Eu)

/** \brief 5470, Read Data and Bit Flip Register 8 */
#define MTU_MC84_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066470u)

/** \brief 5472, Read Data and Bit Flip Register 9 */
#define MTU_MC84_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066472u)

/** \brief 5474, Read Data and Bit Flip Register 10 */
#define MTU_MC84_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066474u)

