HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_reg.h
/** \brief 577C, Read Data and Bit Flip Register 14 */
#define MTU_MC87_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006677Cu)

/** \brief 577E, Read Data and Bit Flip Register 15 */
#define MTU_MC87_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006677Eu)

/** \brief 5780, Read Data and Bit Flip Register 16 */
#define MTU_MC87_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066780u)

/** \brief 5782, Read Data and Bit Flip Register 17 */
#define MTU_MC87_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066782u)

/** \brief 5784, Read Data and Bit Flip Register 18 */
#define MTU_MC87_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066784u)

/** \brief 5786, Read Data and Bit Flip Register 19 */
#define MTU_MC87_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066786u)

/** \brief 5788, Read Data and Bit Flip Register 20 */
#define MTU_MC87_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066788u)

/** \brief 578A, Read Data and Bit Flip Register 21 */
#define MTU_MC87_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006678Au)

/** \brief 578C, Read Data and Bit Flip Register 22 */
#define MTU_MC87_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006678Cu)

/** \brief 578E, Read Data and Bit Flip Register 23 */
#define MTU_MC87_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006678Eu)

/** \brief 5790, Read Data and Bit Flip Register 24 */
#define MTU_MC87_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066790u)

/** \brief 5792, Read Data and Bit Flip Register 25 */
#define MTU_MC87_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066792u)

/** \brief 5794, Read Data and Bit Flip Register 26 */
#define MTU_MC87_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066794u)

/** \brief 5796, Read Data and Bit Flip Register 27 */
#define MTU_MC87_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066796u)

/** \brief 5798, Read Data and Bit Flip Register 28 */
#define MTU_MC87_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066798u)

/** \brief 579A, Read Data and Bit Flip Register 29 */
#define MTU_MC87_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006679Au)

/** \brief 579C, Read Data and Bit Flip Register 30 */
#define MTU_MC87_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006679Cu)

/** \brief 579E, Read Data and Bit Flip Register 31 */
#define MTU_MC87_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006679Eu)

/** \brief 57A0, Read Data and Bit Flip Register 32 */
#define MTU_MC87_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A0u)

/** \brief 57A2, Read Data and Bit Flip Register 33 */
#define MTU_MC87_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A2u)

/** \brief 57A4, Read Data and Bit Flip Register 34 */
#define MTU_MC87_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A4u)

/** \brief 57A6, Read Data and Bit Flip Register 35 */
#define MTU_MC87_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A6u)

/** \brief 57A8, Read Data and Bit Flip Register 36 */
#define MTU_MC87_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667A8u)

/** \brief 57AA, Read Data and Bit Flip Register 37 */
#define MTU_MC87_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667AAu)

/** \brief 57AC, Read Data and Bit Flip Register 38 */
#define MTU_MC87_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667ACu)

/** \brief 57AE, Read Data and Bit Flip Register 39 */
#define MTU_MC87_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667AEu)

/** \brief 57B0, Read Data and Bit Flip Register 40 */
#define MTU_MC87_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B0u)

/** \brief 57B2, Read Data and Bit Flip Register 41 */
#define MTU_MC87_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B2u)

/** \brief 57B4, Read Data and Bit Flip Register 42 */
#define MTU_MC87_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B4u)

/** \brief 57B6, Read Data and Bit Flip Register 43 */
#define MTU_MC87_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B6u)

/** \brief 57B8, Read Data and Bit Flip Register 44 */
#define MTU_MC87_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667B8u)

/** \brief 57BA, Read Data and Bit Flip Register 45 */
#define MTU_MC87_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667BAu)

/** \brief 57BC, Read Data and Bit Flip Register 46 */
#define MTU_MC87_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667BCu)

/** \brief 57BE, Read Data and Bit Flip Register 47 */
#define MTU_MC87_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667BEu)

/** \brief 57C0, Read Data and Bit Flip Register 48 */
#define MTU_MC87_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C0u)

/** \brief 57C2, Read Data and Bit Flip Register 49 */
#define MTU_MC87_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C2u)

/** \brief 57C4, Read Data and Bit Flip Register 50 */
#define MTU_MC87_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C4u)

/** \brief 57C6, Read Data and Bit Flip Register 51 */
#define MTU_MC87_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C6u)

/** \brief 57C8, Read Data and Bit Flip Register 52 */
#define MTU_MC87_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667C8u)

/** \brief 57CA, Read Data and Bit Flip Register 53 */
#define MTU_MC87_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667CAu)

/** \brief 57CC, Read Data and Bit Flip Register 54 */
#define MTU_MC87_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667CCu)

/** \brief 57CE, Read Data and Bit Flip Register 55 */
#define MTU_MC87_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667CEu)

/** \brief 57D0, Read Data and Bit Flip Register 56 */
#define MTU_MC87_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D0u)

/** \brief 57D2, Read Data and Bit Flip Register 57 */
#define MTU_MC87_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D2u)

/** \brief 57D4, Read Data and Bit Flip Register 58 */
#define MTU_MC87_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D4u)

/** \brief 57D6, Read Data and Bit Flip Register 59 */
#define MTU_MC87_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D6u)

/** \brief 57D8, Read Data and Bit Flip Register 60 */
#define MTU_MC87_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667D8u)

/** \brief 57DA, Read Data and Bit Flip Register 61 */
#define MTU_MC87_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667DAu)

/** \brief 57DC, Read Data and Bit Flip Register 62 */
#define MTU_MC87_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667DCu)

/** \brief 57DE, Read Data and Bit Flip Register 63 */
#define MTU_MC87_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667DEu)

/** \brief 57E0, Read Data and Bit Flip Register 64 */
#define MTU_MC87_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667E0u)

/** \brief 57E2, Read Data and Bit Flip Register 65 */
#define MTU_MC87_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667E2u)

/** \brief 57E4, Read Data and Bit Flip Register 66 */
#define MTU_MC87_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00667E4u)

/** \brief 57EE, Alarm Sources Configuration Register */
#define MTU_MC87_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00667EEu)

/** \brief 57F0, SSH Safety Faults Status Register  */
#define MTU_MC87_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00667F0u)

/** \brief 57F2, Error Information Register 0 */
#define MTU_MC87_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F2u)

/** \brief 57F4, Error Information Register 1 */
#define MTU_MC87_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F4u)

/** \brief 57F6, Error Information Register 2 */
#define MTU_MC87_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F6u)

/** \brief 57F8, Error Information Register 3 */
#define MTU_MC87_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667F8u)

/** \brief 57FA, Error Information Register 4 */
#define MTU_MC87_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00667FAu)

/** \brief 5800, Configuration Registers */
#define MTU_MC88_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066800u)

